[
    {
        "day": "Segunda, 26 de Agosto",
        "lectures": [
            {
                "title": "Errâncias de um Software Brasileiro",
                "speakerPlace": "PUC-Rio",
                "speakers": [
                    {
                        "speaker": "Roberto Ierusalimschy",
                        "speakerTitle": "Professor Associado",
                        "speakerPhoto": "Roberto-Ierusalimschy.jpg",
                        "bio": "Roberto Ierusalimschy é Professor Associado da PUC-Rio, onde atua na área de projeto e implementação de linguagens de programação. Ele também é o principal projetista da linguagem Lua. Em 2013 foi agraciado com o Prêmio do Mérito Científico da Sociedade Brasileira de Computação. Roberto foi Distinguished Speaker da ACM e Tinker Professor da Universidade Stanford. Atualmente é Conferencista Senior da SBC e membro do IFIP Working Group de projeto de linguagens."
                    }
                ],
                "description": "Lua é uma linguagem de programação desenvolvida na PUC-Rio que se tornou a linguagem mais usada para \"script\" de jogos, além de ser usada extensivamente em muitas outras áreas e aplicações, da Wikipedia até a Internet das Coisas. A primeira versão da linguagem foi criada em 1993, como uma linguagem de configuração para uso interno. Com o passar dos anos, seu uso foi se difundindo para outras áreas, como jogos e sistemas embarcados. Simultaneamente, tanto o projeto quanto a implementação da linguagem amadureceram.<br />Essa palestra relata a história da linguagem e como ela veio a adquirir essa relevância global, analisando porque diferentes áreas adotaram a linguagem. Iremos discutir também como pretendemos continuar sua evolução.",
                "time": "13:30 - 14:20"
            },
            {
                "title": "Cobli",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "lorem ipson",
                "time": "14:30 - 15:20"
            },
            {
                "title": "Coffee-Break",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "15:20 - 16:00"
            },
            {
                "title": "Nvidia",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "lorem ipson",
                "time": "16:00 - 16:50"
            },
            {
                "title": "Opus",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "lorem ipson",
                "time": "17:00 - 17:50"
            }
        ]
    },
    {
        "day": "Terça, 27 de Agosto",
        "lectures": [
            {
                "title": "UX/UI - Metodologias e práticas na criação de produtos digitais",
                "speakerPlace": "FAU-USP",
                "speakers": [
                    {
                        "speaker": "Leandro Velloso",
                        "speakerTitle": "Professor Doutor",
                        "speakerPhoto": "leandrovelloso.png",
                        "bio": "Leandro Manuel Reis Velloso é Professor Doutor na Faculdade de Arquitetura e Urbanismo da Universidade de São Paulo (FAU-USP). Doutor em Ciências pela mesma instituição (2017), com pesquisa em metodologias do design de interação e informação. Foi coordenador do curso de pós-graduação em Design de Interação no Istituto Europeo di Design (IED-SP). Participante convidado do laboratório Walking and Interaction, parte do curso Kosmos Summer University na Humboldt-Universität zu Berlin (2013). Possui extensa experiência profissional em projetos de interação e comunicação, além de produção artística envolvendo novas tecnologias de computação."
                    }
                ],
                "description": "Uma conversa sobre a prática do designer no mercado de UX/UI. Vamos abordar temas como metodologias criativas, o perfil do profissional que trabalha com criação e desenvolvimento de produtos digitais e as ferramentas mais utilizadas, como sketches, wireframes, softwares de prototipação, criação de personas, cocriação e testes com usuário.",
                "time": "13:30 - 14:20"
            },
            {
                "title": "Agilidade na vida real: desenvolvimento web vs ciência de dados",
                "speakerPlace": "Lendico",
                "speakers": [
                    {
                        "speaker": "Cintia Barbosa",
                        "speakerTitle": "",
                        "speakerPhoto": "cintia_metodos_ageis.jpg",
                        "bio": ""
                    },
                    {
                        "speaker": "Larissa Moraes",
                        "speakerTitle": "",
                        "speakerPhoto": "larissa_metodos_ageis.jpg",
                        "bio": ""
                    }
                ],
                "description": "Metodologia ágil está em alta no mercado, mas a implementação no dia-a-dia de trabalho das empresas é algo que traz muitos desafios. Nesta palestra iremos falar da experiência que tivemos na Lendico para implementar a metodologia ágil nos times de desenvolvimento web e também de ciência de dados, contando um pouco das adaptações que fizemos para cada time.  ",
                "time": "14:30 - 15:20"
            },
            {
                "title": "Coffee-Break",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "15:20 - 16:00"
            },
            {
                "title": "Programação Criativa: Programando para as Artes",
                "speakerPlace": "UFF",
                "speakers": [
                    {
                        "speaker": "Bernardo Fontes",
                        "speakerTitle": "",
                        "speakerPhoto": "bernardo_artecomp.jpg",
                        "bio": "Formado pela UFF em 2011 em Ciência da Computação, trabalha com Python faz anos, desenvolvendo aplicações web, criando serviços e processando dados. É o criador do pyp5.js, ferramenta que traduz código em Python para p5.js, e mantém a biblioteca de Python model_mommy, feita para ajudar a escrever testes para aplicações Django. Além disso, utiliza a computação para exercer sua criatividade, escrevendo poesias, compondo músicas e desenhando usando matemática e Processing (uma linguagem própria para isso)."
                    }
                ],
                "description": "Como traduzir a natureza da programação, algo inerentemente exato e binário, para o campo subjetivo das artes? A prática da programação criativa viabiliza esse feito ao mudar a maneira com que pensamos e usamos programação. Nessa apresentação, falarei sobre o tema e mostrando exemplos de código Python.",
                "time": "16:00 - 16:50"
            },
            {
                "title": "Descubra",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "lorem ipson",
                "time": "17:00 - 17:50"
            }
        ]
    },
    {
        "day": "Quarta, 28 de Agosto",
        "lectures": [
            {
                "title": "Protocolos Zero",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "lorem ipson",
                "time": "13:30 - 14:20"
            },
            {
                "title": "Controle de Versão com Git",
                "speakerPlace": "Caelum",
                "speakers": [
                    {
                        "speaker": "Vanessa Tonini",
                        "speakerTitle": "Desenvolvedora de Software",
                        "speakerPhoto": "vanessaTonini.png",
                        "bio": "Instrutora e desenvolvedora na Caelum, trabalha como desenvolvedora de software há mais de 10 anos. Formada em Sistemas para Internet na UNIVALI, com especialização em desenvolvimento Web pela UTFPR e MBA em Engenharia de Software pela FIAP, hoje é estudante no mestrado em Ciência da Computação no IME/USP. Também faz parte da coordenação do coletivo hacker feminista Marialab."
                    }
                ],
                "description": "No mundo de desenvolvimento de software, para qualquer fim, é necessário que armazenar e registrar o histórico de alteração do código fonte, para que seja possível sua continuidade por outras pessoas ou até por você mesma.<br />Nesta palestra, veremos um breve histórico dos sistemas de controle de versão, o conceito por trás, e se aprofundar no mais popular no mundo, o Git, que foi criado por Linus Torvalds. Ao fim, conheceremos o essencial para utilizá-lo no dia a dia.",
                "time": "14:30 - 15:20"
            },
            {
                "title": "Coffee-Break",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "15:20 - 16:00"
            },
            {
                "title": "Descubra",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "lorem ipson",
                "time": "16:00 - 16:50"
            },
            {
                "title": "Nubank",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "lorem ipson",
                "time": "17:00 - 17:50"
            }
        ]
    },
    {
        "day": "Quinta, 29 de Agosto",
        "lectures": [
            {
                "title": "Visão Computacional",
                "speakerPlace": "DCC-UFMG",
                "speakers": [
                    {
                        "speaker": "Erickson Rangel do Nascimento",
                        "speakerTitle": "Assistant Professor",
                        "speakerPhoto": "erickson_rangel_do_nascimento.jpg",
                        "bio": "Prof. Erickson is an Assistant Professor in the Department of Computer Science at Federal University of Minas Gerais (UFMG), Brazil. He received my B.S., M.S. and D.Sc degrees in Computer Science from the Federal University of Minas Gerais, in 2005, 2008 and 2012 respectively. He was also a visiting researcher at The Berkeley Artificial Intelligence Research (BAIR) of the University of California Berkeley from 07/2017 to 12/2018. His research interests include Computer Vision, Pattern Recognition and Graphics."
                    }
                ],
                "description": "Nesta palestra serão discutidos os principais problemas do processamento de vídeos filmados em primeira pessoa. Mostraremos os resultados alcançados atualmente pela comunidade de visão computacional e possíveis problemas de pesquisa. Apresentaremos também o projeto Semantic Hyperlapse (https://www.verlab.dcc.ufmg.br/semantic-hyperlapse), desenvolvido nos últimos anos no contexto do DCC-UFMG.",
                "time": "13:30 - 14:20"
            },
            {
                "title": "Santander",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "lorem ipson",
                "time": "14:30 - 15:20"
            },
            {
                "title": "Coffee-Break",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "15:20 - 16:00"
            },
            {
                "title": "ED Cris",
                "speakerPlace": "IME-USP",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "lorem ipson",
                "time": "16:00 - 16:50"
            },
            {
                "title": "Concepta",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "lorem ipson",
                "time": "17:00 - 17:50"
            }
        ]
    },
    {
        "day": "Sexta, 30 de Agosto",
        "lectures": [
            {
                "title": "Um dia na computação!",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "",
                        "bio": ""
                    }
                ],
                "description": "lorem ipson",
                "time": "10:00 - 16:00"
            }
        ]
    }
]
