[
    {
        "day": "Segunda, 26 de Agosto",
        "lectures": [
            {
                "title": "Errâncias de um Software Brasileiro",
                "speakerPlace": "PUC-Rio",
                "speakers": [
                    {
                        "speaker": "Roberto Ierusalimschy",
                        "speakerTitle": "Professor Associado",
                        "speakerPhoto": "Roberto-Ierusalimschy.jpg",
                        "bio": "Roberto Ierusalimschy é Professor Associado da PUC-Rio, onde atua na área de projeto e implementação de linguagens de programação. Ele também é o principal projetista da linguagem Lua. Em 2013 foi agraciado com o Prêmio do Mérito Científico da Sociedade Brasileira de Computação. Roberto foi Distinguished Speaker da ACM e Tinker Professor da Universidade Stanford. Atualmente é Conferencista Senior da SBC e membro do IFIP Working Group de projeto de linguagens."
                    }
                ],
                "description": "Lua é uma linguagem de programação desenvolvida na PUC-Rio que se tornou a linguagem mais usada para \"script\" de jogos, além de ser usada extensivamente em muitas outras áreas e aplicações, da Wikipedia até a Internet das Coisas. A primeira versão da linguagem foi criada em 1993, como uma linguagem de configuração para uso interno. Com o passar dos anos, seu uso foi se difundindo para outras áreas, como jogos e sistemas embarcados. Simultaneamente, tanto o projeto quanto a implementação da linguagem amadureceram.<br />Essa palestra relata a história da linguagem e como ela veio a adquirir essa relevância global, analisando porque diferentes áreas adotaram a linguagem. Iremos discutir também como pretendemos continuar sua evolução.",
                "time": "13:30 - 14:20"
            },
            {
                "title": "Desafios de Data Science no cotidiano",
                "speakerPlace": "Cobli",
                "speakers": [
                    {
                        "speaker": "Isabela Blucher",
                        "speakerTitle": "Data Scientist",
                        "speakerPhoto": "isabela_cobli.jpg",
                        "bio": "Isabela Blucher está no último ano da graduação em Ciência da Computação no Instituto de Matemática e Estatística da USP. Durante a graduação, participou de grupos de extensão nas áreas de desenvolvimento de jogos digitais e computação social. Passou um semestre na Universidade de Copenhagen, na Dinamarca, em um intercâmbio acadêmico, onde cursou disciplinas do programa de Mestrado em Computação. Hoje em dia, trabalha na Cobli, uma startup de logística e gestão de frotas, como Data Scientist."
                    },
                    {
                        "speaker": "Gustavo Momente",
                        "speakerTitle": "Tech Leader",
                        "speakerPhoto": "gustavo_cobli.jpg",
                        "bio": "Gustavo é graduado em engenharia mecatrônica pela Escola Politécnica da USP e pela ENSTA ParisTech e tem mestrado em ciência da computação pela UPMC. Atualmente é tech leader do time de processamento de dados na Cobli. Anteriormente trabalhou e desenvolveu pesquisa em processamento de linguagem natural."
                    }
                ],
                "description": "Quais são os desafios de Data Science que enfrentamos no dia a dia e como encontramos soluções? Gustavo Momente, especialista em engenharia de software, e Isabela Blucher, cientista de dados, contam mais sobre essa jornada por meio de dois projetos da Cobli: detecção de motoristas e detecção de acidentes.",
                "time": "14:30 - 15:20"
            },
            {
                "title": "Coffee-Break",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "15:20 - 16:00"
            },
            {
                "title": "Reinventando a Computação Visual com Inteligência Artificial",
                "speakerPlace": "NVIDIA",
                "speakers": [
                    {
                        "speaker": "João Paulo Navarro",
                        "speakerTitle": "Arquiteto de Soluções",
                        "speakerPhoto": "joao_paulo_navarro.jpg",
                        "bio": "Cientista da Computação e mestre em Modelagem Computacional (UFJF), tendo dedicado boa parte de sua carreira ao desenvolvimento de projetos nas áreas de computação gráfica, simulação física e machine learning. Possui ampla experiência no desenvolvimento de algoritmos de visualização e aprendizado de máquina voltados ao processamento geofísico. Hoje, na NVIDIA, é Arquiteto de Soluções com foco em computação de alto-desempenho, deep learning e machine learning."
                    }
                ],
                "description": "A computação visual está sendo totalmente reinventada com a combinação de processamento de alta-performance utilizando GPUs da NVIDIA e novas técnicas de Inteligência Artificial. Nesta conversa abordaremos o estado da arte em diferentes áreas do conhecimento como Processamento de Imagens, Computação Gráfica, Visão Computacional, Carros Autônomos e entender o que nos espera neste fascinante momento da tecnologia.",
                "time": "16:00 - 16:50"
            },
            {
                "title": "Em breve",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "17:00 - 17:50"
            }
        ]
    },
    {
        "day": "Terça, 27 de Agosto",
        "lectures": [
            {
                "title": "UX/UI - Metodologias e práticas na criação de produtos digitais",
                "speakerPlace": "FAU-USP",
                "speakers": [
                    {
                        "speaker": "Leandro Velloso",
                        "speakerTitle": "Professor Doutor",
                        "speakerPhoto": "leandrovelloso.png",
                        "bio": "Leandro Manuel Reis Velloso é Professor Doutor na Faculdade de Arquitetura e Urbanismo da Universidade de São Paulo (FAU-USP). Doutor em Ciências pela mesma instituição (2017), com pesquisa em metodologias do design de interação e informação. Foi coordenador do curso de pós-graduação em Design de Interação no Istituto Europeo di Design (IED-SP). Participante convidado do laboratório Walking and Interaction, parte do curso Kosmos Summer University na Humboldt-Universität zu Berlin (2013). Possui extensa experiência profissional em projetos de interação e comunicação, além de produção artística envolvendo novas tecnologias de computação."
                    }
                ],
                "description": "Uma conversa sobre a prática do designer no mercado de UX/UI. Vamos abordar temas como metodologias criativas, o perfil do profissional que trabalha com criação e desenvolvimento de produtos digitais e as ferramentas mais utilizadas, como sketches, wireframes, softwares de prototipação, criação de personas, cocriação e testes com usuário.",
                "time": "13:30 - 14:20"
            },
            {
                "title": "Agilidade na vida real: desenvolvimento web vs ciência de dados",
                "speakerPlace": "Lendico",
                "speakers": [
                    {
                        "speaker": "Cintia Barbosa",
                        "speakerTitle": "",
                        "speakerPhoto": "cintia_metodos_ageis.jpg",
                        "bio": ""
                    },
                    {
                        "speaker": "Larissa Moraes",
                        "speakerTitle": "",
                        "speakerPhoto": "larissa_metodos_ageis.jpg",
                        "bio": ""
                    }
                ],
                "description": "Metodologia ágil está em alta no mercado, mas a implementação no dia-a-dia de trabalho das empresas é algo que traz muitos desafios. Nesta palestra iremos falar da experiência que tivemos na Lendico para implementar a metodologia ágil nos times de desenvolvimento web e também de ciência de dados, contando um pouco das adaptações que fizemos para cada time.  ",
                "time": "14:30 - 15:20"
            },
            {
                "title": "Coffee-Break",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "15:20 - 16:00"
            },
            {
                "title": "Programação Criativa: Programando para as Artes",
                "speakerPlace": "UFF",
                "speakers": [
                    {
                        "speaker": "Bernardo Fontes",
                        "speakerTitle": "",
                        "speakerPhoto": "bernardo_artecomp.jpg",
                        "bio": "Formado pela UFF em 2011 em Ciência da Computação, trabalha com Python faz anos, desenvolvendo aplicações web, criando serviços e processando dados. É o criador do pyp5.js, ferramenta que traduz código em Python para p5.js, e mantém a biblioteca de Python model_mommy, feita para ajudar a escrever testes para aplicações Django. Além disso, utiliza a computação para exercer sua criatividade, escrevendo poesias, compondo músicas e desenhando usando matemática e Processing (uma linguagem própria para isso)."
                    }
                ],
                "description": "Como traduzir a natureza da programação, algo inerentemente exato e binário, para o campo subjetivo das artes? A prática da programação criativa viabiliza esse feito ao mudar a maneira com que pensamos e usamos programação. Nessa apresentação, falarei sobre o tema e mostrando exemplos de código Python.",
                "time": "16:00 - 16:50"
            },
            {
                "title": "Em breve",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "17:00 - 17:50"
            }
        ]
    },
    {
        "day": "Quarta, 28 de Agosto",
        "lectures": [
            {
                "title": "Protocolos Zero-Conhecimento",
                "speakerPlace": "UNICAMP",
                "speakers": [
                    {
                        "speaker": "Eduardo Morais",
                        "speakerTitle": "",
                        "speakerPhoto": "eduardo_morais_protocolos.jpg",
                        "bio": ""
                    }
                ],
                "description": "Nesta apresentação serão descritas técnicas criptográficas que podem ser utilizadas para prover privacidade no contexto de aplicações Blockchain. Em particular, será dada ênfase em provas de conhecimento zero.",
                "time": "13:30 - 14:20"
            },
            {
                "title": "Controle de Versão com Git",
                "speakerPlace": "Caelum",
                "speakers": [
                    {
                        "speaker": "Vanessa Tonini",
                        "speakerTitle": "Desenvolvedora de Software",
                        "speakerPhoto": "vanessaTonini.png",
                        "bio": "Instrutora e desenvolvedora na Caelum, trabalha como desenvolvedora de software há mais de 10 anos. Formada em Sistemas para Internet na UNIVALI, com especialização em desenvolvimento Web pela UTFPR e MBA em Engenharia de Software pela FIAP, hoje é estudante no mestrado em Ciência da Computação no IME/USP. Também faz parte da coordenação do coletivo hacker feminista Marialab."
                    }
                ],
                "description": "No mundo de desenvolvimento de software, para qualquer fim, é necessário que armazenar e registrar o histórico de alteração do código fonte, para que seja possível sua continuidade por outras pessoas ou até por você mesma.<br />Nesta palestra, veremos um breve histórico dos sistemas de controle de versão, o conceito por trás, e se aprofundar no mais popular no mundo, o Git, que foi criado por Linus Torvalds. Ao fim, conheceremos o essencial para utilizá-lo no dia a dia.",
                "time": "14:30 - 15:20"
            },
            {
                "title": "Coffee-Break",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "15:20 - 16:00"
            },
            {
                "title": "Privacidade, Proteção de Dados Pessoais e LGPD: tensões e sinergias entre legislação e tecnologia.",
                "speakerPlace": "Data Privacy Brasil",
                "speakers": [
                    {
                        "speaker": "Mariana Rielli",
                        "speakerTitle": "Líder de Projetos",
                        "speakerPhoto": "mariana_rielli_privacidade.jpg",
                        "bio": "Graduada em Direito pela Universidade de São Paulo. Durante a graduação, participou de diversas iniciativas de pesquisa e extensão, dentre as quais o Núcleo Direito Internet e Sociedade (NDIS). Cursa, atualmente, Especialização em Ciências Políticas na Fundação Escola de Sociologia e Política de São Paulo (FESP-SP). Trabalhou por 4 anos na organização não-governamental ARTIGO 19, focada em liberdade de expressão e acesso à informação, e hoje é pesquisadora e líder de projetos do Data Privacy Brasil, think tank em privacidade e proteção de dados pessoais."
                    }
                ],
                "description": "1. Introdução sobre privacidade x proteção de dados pessoais. 2. Ecossistema regulatório brasileiro: como chegamos até a LGPD. 3. Principais pontos sobre a legislação. 3.1. Fundamentos, princípios e bases legais. 3.2. Privacy by design e regulação do risco. 3.3. Legislação tecnicamente neutra. 4. 1 ano para a entrada em vigor da LGPD: quais os principais desafios? 5. Os papéis do direito e da tecnologia na proteção de dados: aprendizados históricos e lições para o futuro. ",
                "time": "16:00 - 16:50"
            },
            {
                "title": "Em breve",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "17:00 - 17:50"
            }
        ]
    },
    {
        "day": "Quinta, 29 de Agosto",
        "lectures": [
            {
                "title": "Visão Computacional",
                "speakerPlace": "DCC-UFMG",
                "speakers": [
                    {
                        "speaker": "Erickson Rangel do Nascimento",
                        "speakerTitle": "Assistant Professor",
                        "speakerPhoto": "erickson_rangel_do_nascimento.jpg",
                        "bio": "Prof. Erickson is an Assistant Professor in the Department of Computer Science at Federal University of Minas Gerais (UFMG), Brazil. He received my B.S., M.S. and D.Sc degrees in Computer Science from the Federal University of Minas Gerais, in 2005, 2008 and 2012 respectively. He was also a visiting researcher at The Berkeley Artificial Intelligence Research (BAIR) of the University of California Berkeley from 07/2017 to 12/2018. His research interests include Computer Vision, Pattern Recognition and Graphics."
                    }
                ],
                "description": "Nesta palestra serão discutidos os principais problemas do processamento de vídeos filmados em primeira pessoa. Mostraremos os resultados alcançados atualmente pela comunidade de visão computacional e possíveis problemas de pesquisa. Apresentaremos também o projeto Semantic Hyperlapse (https://www.verlab.dcc.ufmg.br/semantic-hyperlapse), desenvolvido nos últimos anos no contexto do DCC-UFMG.",
                "time": "13:30 - 14:20"
            },
            {
                "title": "Em breve",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "statue.png",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "14:30 - 15:20"
            },
            {
                "title": "Coffee-Break",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "15:20 - 16:00"
            },
            {
                "title": "Estruturas de Dados e Algoritmos: Viagem no Tempo e no Espaço",
                "speakerPlace": "IME-USP",
                "speakers": [
                    {
                        "speaker": "Cristina G. Fernandes",
                        "speakerTitle": "Professora Associada",
                        "speakerPhoto": "cristina_fernandes.jpg",
                        "bio": "Cristina G. Fernandes é professora do Departamento de Ciência da Computação da Universidade de São Paulo (USP) desde 1988.  Ela é Bacharel em Ciência da Computação e Mestre em Matemática Aplicada pela USP. Fez o doutorado no Georgia Institute of Technology, EUA, no Programa Algorithms, Combinatorics, and Optimization. Desde o seu doutorado, ela trabalha em problemas de três áreas: algoritmos, teoria dos grafos, e otimização combinatória. Uma de suas citações favoritas é \"Talk is cheap. Show me the code.\", de Linus Torvalds."
                    }
                ],
                "description": "Estruturas de dados permitem operações de acesso e de modificação.  As operações de modificação usualmente alteram, em geral de forma irreversível, o estado da estrutura, impedindo assim o acesso a versões anteriores desta. Existem na literatura versões das estruturas de dados mais conhecidas que permitem não só o acesso a versões anteriores da estrutura, mas também modificações a estas versões anteriores. Estas são chamada de estruturas de dados temporais. Evidentemente o que se busca são estruturas de dados temporais eficientes, tanto em termos de consumo de tempo como de espaço. Esta palestra será uma introdução a estruturas de dados temporais, incluindo um exemplo de aplicação de uma destas estruturas em geometria computacional.",
                "time": "16:00 - 16:50"
            },
            {
                "title": "250 metros em 10 anos: a lenta trajetória até minha startup",
                "speakerPlace": "Concepta",
                "speakers": [
                    {
                        "speaker": "Guto Motta",
                        "speakerTitle": "Empreendedor",
                        "speakerPhoto": "guto_motta.jpg",
                        "bio": "Guto Motta é Co-Fundador da Concepta Asset Management, onde lidera as equipes de Ciência e Tecnologia na construção de ferramentas que fazem a gestão quantitativa de recursos financeiros. Antes da Concepta Guto fundou startups, levantou investimentos, testou hipóteses, pivotou projetos, recrutou equipes e construiu tecnologias que ajudaram a desenvolver os negócios de empresas brasileiras como iFood, Movile e Easynvest. Guto foi aluno do IME entre 1997 e 2000, quando se formou no BCC e começou sua jornada profissional trabalhando numa startup fundada por outros imeanos."
                    }
                ],
                "description": "Em março de 2019 a plataforma Distrito, em parceria com a KPMG, divulgou o relatório Corrida dos Unicórnios, um levantamento das startups brasileiras avaliadas em mais de US$ 1 bilhão. A conclusão: 10 dos 16 fundadores de unicórnios brasileiros são formados pela USP. Mas será que esses uspianos fundaram suas empresas logo depois da graduação? Como a experiência universitária contribuiu na jornada até o empreendedorismo? Que outros fatores são determinantes pro sucesso de uma startup?",
                "time": "17:00 - 17:50"
            }
        ]
    },
    {
        "day": "Sexta, 30 de Agosto",
        "lectures": [
            {
                "title": "Um dia na computação!",
                "speakerPlace": "",
                "speakers": [
                    {
                        "speaker": "",
                        "speakerTitle": "",
                        "speakerPhoto": "",
                        "bio": ""
                    }
                ],
                "description": "",
                "time": "10:00 - 16:00"
            }
        ]
    }
]
